# Users

In [5]:
import pandas as pd

users = pd.read_csv('data_old/sc_report_user.csv')
print(users.shape)
users.head()

(100, 5)

   id user_type            name   birthdate  gender
0   1     guest    Tabbi Sandes   4/12/2004  Female
1   2     owner    Spense Tille   9/27/2008    Male
2   3    tenant   Maurise Peele  11/16/2009    Male
3   4  resident  Alleen Bealton   9/26/1988  Female
4   5  resident   Manolo Magnay    3/6/1987    Male

In [17]:
del users['user_type']

In [18]:
users.head()

   id            name   birthdate  gender
0   1    Tabbi Sandes   4/12/2004  Female
1   2    Spense Tille   9/27/2008    Male
2   3   Maurise Peele  11/16/2009    Male
3   4  Alleen Bealton   9/26/1988  Female
4   5   Manolo Magnay    3/6/1987    Male

In [19]:
users.to_csv('data_table/user.csv', index = False)

# Project

In [6]:
projects = pd.read_csv('data_old/sc_report_projects.csv')
print(projects.shape)
projects

(10, 2)

   id                      name
0   1     Yizhang Chengguanzhen
1   2                 Il’ichëvo
2   3                  Gedangan
3   4                  Zhoutian
4   5                Izhmorskiy
5   6                  Yingkeng
6   7                    Taytay
7   8                    Donglu
8   9                 Nishiwaki
9  10  Nossa Senhora do Socorro

### Geo maps in Data Studio
A Data Studio geo map requires you to provide 3 pieces of information:

- a geographic dimension, such as Country, City, Region, etc.
- a metric, such as Sessions, Units Sold, Population, etc.
- the map's zoom area

City = Bangkok

1012728
Bangkok,Bangkok,Thailand

21025
Bangkok,Thailand

- City
- City Code
- Metro
- Metro Code
- Region
- Region Code
- Latitude, Longitude

เขต ประทุมวัน
เขต สาธร
เขต มีนบุรี
เขต จตุจักร
เขต บางกระปิ
เขต ท่าข้าม
เขต บางขุนเทียน
เขต ห้วยขวาง
เขต วัฒนา
เขต จอมทอง

In [22]:
projects.to_csv('data_table/project.csv', index = False)

# Article

In [302]:
articles = pd.read_csv('data_old/sc_report_topics1.csv')
print(articles.shape)
articles.head()

(100, 7)

,id,name,type,read_time,read_lenght,created_at,published_at
0,1,"Pont du Nord, Le",etc,385.0,72,2018-03-27 04:39:41,2018-02-13 17:35:39
1,2,"Glass Shield, The",event,311.7,50,2017-08-12 05:40:08,2017-08-17 13:34:08
2,3,"Wizard, The",news,260.1,35,2018-02-16 08:39:45,2017-07-31 02:14:10
3,4,Marihuana,privilege,286.8,76,2018-03-15 20:57:59,2017-10-20 13:51:06
4,5,Once Upon a Time in China II (Wong Fei-hung Ji...,etc,650.1,68,2017-05-07 10:39:41,2017-10-18 10:22:59

In [307]:
if 'read_lenght' in articles:
    del articles['read_lenght']

In [308]:
articles.head()

,id,name,type,read_time,created_at,published_at
0,1,"Pont du Nord, Le",etc,385.0,2018-03-27 04:39:41,2018-02-13 17:35:39
1,2,"Glass Shield, The",event,311.7,2017-08-12 05:40:08,2017-08-17 13:34:08
2,3,"Wizard, The",news,260.1,2018-02-16 08:39:45,2017-07-31 02:14:10
3,4,Marihuana,privilege,286.8,2018-03-15 20:57:59,2017-10-20 13:51:06
4,5,Once Upon a Time in China II (Wong Fei-hung Ji...,etc,650.1,2017-05-07 10:39:41,2017-10-18 10:22:59

In [304]:
articles.to_csv('data_table/article.csv', index = False)

In [305]:
articles['id'].unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100])

In [306]:
articles.min()

id                                1
name                    9th Company
type                            etc
read_time                      15.3
created_at      2017-03-30 04:12:04
published_at    2017-04-04 03:40:09
dtype: object

# User-Project

In [33]:
user_project = pd.read_csv('data_old/user_project.csv')
print(user_project.shape)
user_project.head()

(300, 3)

   user_id  project_id user_type
0       23           7  resident
1       29           6     guest
2       52           8    tenant
3       33           4  resident
4       26          10  resident

In [53]:
user_project_grouped = user_project.groupby(['user_id','project_id']).count()
user_project_grouped.head()

                    user_type
user_id project_id
1       2                   1
        7                   1
        9                   2
2       2                   1
        4                   1

In [69]:
new_user_project = user_project.drop_duplicates(subset=['user_id', 'project_id'], keep='first')
new_user_project.groupby(['user_id','project_id']).count().head()

                    user_type
user_id project_id
1       2                   1
        7                   1
        9                   1
2       2                   1
        4                   1

In [71]:
new_user_project.to_csv('data_table/user_project.csv', index = False)

# Article-Project

In [73]:
article_project = pd.read_csv('data_old/article_project.csv')
print(article_project.shape)
article_project.head()

(1000, 2)

   article_id  project_id
0          45           2
1          97           8
2          91          10
3          88          10
4          59           3

In [80]:
new_article_project = article_project.drop_duplicates(subset=['article_id', 'project_id'], keep='first')
new_article_project.shape

(604, 2)

In [81]:
new_article_project.to_csv('data_table/article_project.csv', index = False)

# Seen

In [101]:
import random
import time

def strTimeProp(start, end, format, prop):
    """Get a time at a proportion of a range of two formatted times.

    start and end should be strings specifying times formated in the
    given format (strftime-style), giving an interval [start, end].
    prop specifies how a proportion of the interval to be taken after
    start.  The returned time will be in the specified format.
    """

    stime = time.mktime(time.strptime(start, format))
    etime = time.mktime(time.strptime(end, format))

    ptime = stime + prop * (etime - stime)

    return time.strftime(format, time.localtime(ptime))


def randomDate(start, end, prop):
    return strTimeProp(start, end, '%Y-%m-%d %H:%M:%S', prop)

In [118]:
seen = pd.DataFrame(columns=['article_id','user_id','seen_at'])
seen

Empty DataFrame
Columns: [article_id, user_id, seen_at]
Index: []

In [120]:
from random import randint

for i in range(36500):
    article_id = randint(1,100)
    user_id = randint(1,100)
    seen_at = randomDate("2017-04-04 04:00:00", "2018-04-11 00:00:00", random.random())
    
    seen_row = pd.DataFrame([[article_id, user_id, seen_at]], columns=['article_id','user_id','seen_at'])
    seen = seen.append(seen_row, ignore_index=True)

In [121]:
print(seen.shape)
seen.head()

(36500, 3)

  article_id user_id              seen_at
0         34      27  2017-10-27 18:44:18
1         78      32  2018-01-12 00:03:53
2         58      97  2018-04-02 18:11:07
3         89      27  2017-07-21 21:26:31
4         70      72  2018-01-28 14:19:25

คนจะเห็นข่าวได้ต้องอยู่ในโครงการที่ข่าวประกาศไป จะได้จำนวนคนที่มีโอกาสเห็นข่าวจากแต่ละโครงการจากการเอา ตาราง **article_project** ไป merge กับ **user_project**

In [175]:
article_project_user = pd.merge(new_article_project, new_user_project, on='project_id')
article_project_user.groupby('project_id')['user_id'].count()

project_id
1     1701
2     1650
3     1525
4     1265
5     1690
6     1378
7     1265
8     1708
9     1711
10    1914
Name: user_id, dtype: int64

ตัวเลขที่เห็นนี้คือจำนวนคนที่มีโอกาสเห็นข่าวจากแต่ละโครงการรวม All time

In [180]:
article_project_user.head()

   article_id  project_id  user_id user_type
0          45           2       93     owner
1          45           2       78  resident
2          45           2       56     guest
3          45           2       98  resident
4          45           2       54    tenant

เมื่อผนวกข้อมูลว่าข่าวประกาศไปโครงการไหนบ้าง กับใครอยู่ในโครงการนั้นบ้าง แล้วคนในโครงการใครบ้างที่เห็นข่าว จะได้จำนวนดังนั้นคนเห็นข่าวจริงๆ ดังนี้

In [188]:
is_seen = pd.merge(article_project_user, seen,  how='inner', left_on=['article_id','user_id'], right_on = ['article_id','user_id'])
print(is_seen.shape)
is_seen.head()

(57730, 5)

  article_id  project_id user_id user_type              seen_at
0         45           2      93     owner  2017-10-29 08:17:51
1         45           2      93     owner  2017-04-28 05:54:41
2         45          10      93     owner  2017-10-29 08:17:51
3         45          10      93     owner  2017-04-28 05:54:41
4         45           3      93     owner  2017-10-29 08:17:51

ลบแถวที่ซ้ำออก (อย่างอื่นซ้ำหมดแต่มี seen_at ไม่ตรงกัน)

In [189]:
is_seen = is_seen.drop_duplicates(subset=['article_id', 'project_id', 'user_id', 'user_type'], keep='first')
print(is_seen.shape)
is_seen.head()

(15397, 5)

  article_id  project_id user_id user_type              seen_at
0         45           2      93     owner  2017-10-29 08:17:51
2         45          10      93     owner  2017-10-29 08:17:51
4         45           3      93     owner  2017-10-29 08:17:51
6         45           2      78  resident  2018-02-16 04:58:48
9         45          10      78     guest  2018-02-16 04:58:48

In [190]:
is_seen.to_csv('data_table/seen.csv', index = False)

# Click

click อาจจะเป็น sampling ของ seen (กรณีที่เข้าได้จากทาง app อย่างเดียว) เอาสัก 40%

In [221]:
click = seen.sample(frac=0.4)
print(click.shape)
click.head()

(14600, 3)

      article_id user_id              seen_at
1957          49       6  2018-02-06 07:12:33
8771          61      13  2018-03-28 16:08:39
30532         41      32  2017-07-27 09:02:37
68            67      97  2017-05-31 11:31:40
7973          90      16  2017-11-03 07:47:23

แล้วทำแบบ Seen

In [247]:
is_click = pd.merge(article_project_user, click,  how='inner', left_on=['article_id','user_id'], right_on = ['article_id','user_id'])
print(is_click.shape)
is_click.head()

(23176, 5)

  article_id  project_id user_id user_type              seen_at
0         45           2      78  resident  2017-06-27 01:20:13
1         45           2      78  resident  2017-08-07 14:43:44
2         45           2      78  resident  2018-02-16 04:58:48
3         45          10      78     guest  2017-06-27 01:20:13
4         45          10      78     guest  2017-08-07 14:43:44

เพิ่มเวลา click ให้หน่อย

In [245]:
from datetime import datetime  
from datetime import timedelta
from random import randint

def addRandomMinute(time,max_minute):
    now = datetime.strptime(time,'%Y-%m-%d %H:%M:%S')
    now_plus_minute = now + timedelta(minutes = randint(1,max_minute))
    return now_plus_minute.strftime('%Y-%m-%d %H:%M:%S')

In [244]:
addRandomMinute('2018-01-02 11:59:00',10)

'2018-01-02 12:05:00'

In [262]:
new_is_click = is_click[:]
new_is_click['seen_at'] = is_click['seen_at'].apply(addRandomMinute, args=(10,))
new_is_click = new_is_click.rename(columns={'seen_at': 'clicked_at'})
new_is_click.head()

  article_id  project_id user_id user_type           clicked_at
0         45           2      78  resident  2017-06-27 01:30:13
1         45           2      78  resident  2017-08-07 14:48:44
2         45           2      78  resident  2018-02-16 05:02:48
3         45          10      78     guest  2017-06-27 01:23:13
4         45          10      78     guest  2017-08-07 14:47:44

In [263]:
new_is_click.to_csv('data_table/click.csv', index = False)

# Read

read เป็น sampling ของ click เอาสัก 70%

In [264]:
read = click.sample(frac=0.7)
print(read.shape)
read.head()

(10220, 3)

      article_id user_id              seen_at
26368         71      88  2017-05-27 00:22:59
29487         33      91  2017-08-26 21:58:07
1240          95       2  2017-10-01 23:21:47
25391         22      80  2018-03-19 13:35:06
25471         61      72  2018-03-13 06:53:12

แล้วทำแบบ Seen

In [266]:
is_read = pd.merge(article_project_user, read,  how='inner', left_on=['article_id','user_id'], right_on = ['article_id','user_id'])
print(is_read.shape)
is_read.head()

(16227, 5)

  article_id  project_id user_id user_type              seen_at
0         45           2      78  resident  2017-06-27 01:20:13
1         45           2      78  resident  2018-02-16 04:58:48
2         45          10      78     guest  2017-06-27 01:20:13
3         45          10      78     guest  2018-02-16 04:58:48
4         45           2      56     guest  2017-04-08 01:16:21

เพิ่ม column read_time(0-1200 วินาที), read_length(0-100%)

In [283]:
import numpy as np
len(is_read)

read_times = np.array([])
read_lengths = np.array([])
for i in range(len(is_read)):
    read_times = np.append(read_times,[randint(0,1200)])
    read_lengths = np.append(read_lengths,[randint(0,100)])
    
is_read['read_time'] = read_times
is_read['read_length'] = read_lengths

In [286]:
if 'seen_at' in is_read:
    del is_read['seen_at']

In [287]:
is_read.head()

  article_id  project_id user_id user_type  read_time  read_length
0         45           2      78  resident      753.0         30.0
1         45           2      78  resident     1076.0          5.0
2         45          10      78     guest      270.0         78.0
3         45          10      78     guest      267.0         94.0
4         45           2      56     guest      938.0         75.0

In [289]:
is_read.to_csv('data_table/read.csv', index = False)

### Add Column is_read

นับว่าอ่านเมื่อ

$$\frac{\text{read time user}}{\text{read time article}} >= 0.7$$

และ

$$\text{read length} > 70$$

In [310]:
articles.head()

,id,name,type,read_time,created_at,published_at
0,1,"Pont du Nord, Le",etc,385.0,2018-03-27 04:39:41,2018-02-13 17:35:39
1,2,"Glass Shield, The",event,311.7,2017-08-12 05:40:08,2017-08-17 13:34:08
2,3,"Wizard, The",news,260.1,2018-02-16 08:39:45,2017-07-31 02:14:10
3,4,Marihuana,privilege,286.8,2018-03-15 20:57:59,2017-10-20 13:51:06
4,5,Once Upon a Time in China II (Wong Fei-hung Ji...,etc,650.1,2017-05-07 10:39:41,2017-10-18 10:22:59

In [311]:
new_read = pd.merge(is_read, articles[['id','read_time']], how='inner', left_on=['article_id'], right_on = ['id'])
print(new_read.shape)
new_read.head()

(16227, 8)

,article_id,project_id,user_id,user_type,read_time_x,read_length,id,read_time_y
0,45,2,78,resident,753.0,30.0,45,730.6
1,45,2,78,resident,1076.0,5.0,45,730.6
2,45,10,78,guest,270.0,78.0,45,730.6
3,45,10,78,guest,267.0,94.0,45,730.6
4,45,2,56,guest,938.0,75.0,45,730.6

In [312]:
new_read['is_read'] = (new_read['read_time_x']/new_read['read_time_y'] > 0.7).astype(int)

In [315]:
if 'id' in new_read:
    del new_read['id'] 
if 'read_time_y' in new_read:
    del new_read['read_time_y']
new_read = new_read.rename(columns={'read_time_x':'read_time'})
new_read.head()

  article_id  project_id user_id user_type  read_time  read_length  is_read
0         45           2      78  resident      753.0         30.0        1
1         45           2      78  resident     1076.0          5.0        1
2         45          10      78     guest      270.0         78.0        0
3         45          10      78     guest      267.0         94.0        0
4         45           2      56     guest      938.0         75.0        1

# Action

action เป็น sampling ของ read เอาสัก 20%

In [318]:
action = is_read.sample(frac=0.2)
print(action.shape)
action.head()

(3245, 6)

      article_id  project_id user_id user_type  read_time  read_length
13257         13           6      33  resident      335.0         99.0
903           42           5       2     owner     1048.0         31.0
12344         72           7      56  resident      370.0         57.0
10776         89           3      67    tenant      961.0          0.0
8455          42          10      26  resident      895.0         45.0

แล้วทำแบบ Seen

In [321]:
new_action = pd.merge(article_project_user, action[['article_id','user_id']],  how='inner', left_on=['article_id','user_id'], right_on = ['article_id','user_id'])
print(new_action.shape)
new_action.head()

(8122, 4)

  article_id  project_id user_id user_type
0         45           2      78  resident
1         45          10      78     guest
2         45           2      68     guest
3         45           2      68     guest
4         45           3      68     guest

เพิ่ม Column `save_at, share_at,love_at,sad_at,angry_at`

In [336]:
import numpy as np

save_at = np.array([])
share_at = np.array([])

love_at = np.array([])
sad_at = np.array([])
angry_at = np.array([])

for i in range(len(new_action)):
    save_data = randomDate("2017-04-04 04:00:00", "2018-04-11 00:00:00", random.random()) if randint(0,1) == 1 else ""
    save_at = np.append(save_at,[save_data])

    share_data = randomDate("2017-04-04 04:00:00", "2018-04-11 00:00:00", random.random()) if randint(0,1) == 1 else "" 
    share_at = np.append(share_at,[share_data])

    action_id = randint(1,3)
    if action_id == 1:
        love_at = np.append(love_at,[randomDate("2017-04-04 04:00:00", "2018-04-11 00:00:00", random.random())])
        sad_at = np.append(sad_at,[""])
        angry_at = np.append(angry_at,[""])
    elif action_id == 2:
        love_at = np.append(love_at,[""])
        sad_at = np.append(sad_at,[randomDate("2017-04-04 04:00:00", "2018-04-11 00:00:00", random.random())])
        angry_at = np.append(angry_at,[""])
    else:
        love_at = np.append(love_at,[""])
        sad_at = np.append(sad_at,[""])
        angry_at = np.append(angry_at,[randomDate("2017-04-04 04:00:00", "2018-04-11 00:00:00", random.random())])
        
new_action['save_at'] = save_at
new_action['share_at'] = share_at
new_action['love_at'] = love_at
new_action['sad_at'] = sad_at
new_action['angry_at'] = angry_at

In [338]:
new_action.head()

,article_id,project_id,user_id,user_type,save_at,share_at,love_at,sad_at,angry_at
0,45,2,78,resident,2017-10-16 05:07:05,2017-12-15 00:35:56,,2017-04-14 08:31:23,
1,45,10,78,guest,,2017-10-02 13:57:08,,2017-11-01 10:29:43,
2,45,2,68,guest,2017-10-03 18:56:37,,,,2017-09-17 08:04:27
3,45,2,68,guest,,,,,2017-06-17 14:41:08
4,45,3,68,guest,,2017-05-14 19:14:30,,,2018-03-26 12:26:20

In [340]:
new_action.to_csv('data_table/action.csv', index = False)

In [3]:
from random import randint
randint(1,3)

3